tcc2/tests/https/performance/results/hey-https-apigw-result.txt

Summary:
  Total:	30.1683 secs
  Slowest:	0.5318 secs
  Fastest:	0.0209 secs
  Average:	0.2324 secs
  Requests/sec:	429.3242
  
  Total data:	220082 bytes
  Size/request:	17 bytes

Response time histogram:
  0.021 [1]	|
  0.072 [2]	|
  0.123 [675]	|■■■■■
  0.174 [130]	|■
  0.225 [5391]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.276 [5333]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.327 [387]	|■■■
  0.379 [905]	|■■■■■■■
  0.430 [0]	|
  0.481 [117]	|■
  0.532 [5]	|


Latency distribution:
  10% in 0.1767 secs
  25% in 0.1846 secs
  50% in 0.2617 secs
  75% in 0.2716 secs
  90% in 0.2774 secs
  95% in 0.3592 secs
  99% in 0.3719 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0002 secs, 0.0209 secs, 0.5318 secs
  DNS-lookup:	0.0001 secs, 0.0000 secs, 0.0086 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0023 secs
  resp wait:	0.2212 secs, 0.0070 secs, 0.4553 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0101 secs

Status code distribution:
  [200]	12946 responses

Error distribution:
  [6]	Get "https://localhost:30443/": EOF